Repository: RacheleSprugnoli/PUs-Alignment-Manzoni
Catalog: TMX/Moore 2022.tmx
Source language: it
Languages: en

source: un tocco e due e tre e seguita
en: One stroke two three and then on and on

source: ne avessero avuto bisogno
en: they needed it

source: scoccò la campana
en: the bells started tolling

source: di galoppo
en: galloping

source: prese la rincorsa
en: She started running

source: mettersi in libertà
en: to free herself

source: Diavolo d' una donna
en: You devil
